<?php
//1. Генерируется 100 случайных чисел. Скрипт выводит их и ищет максимальное и минимальное число.


//2. Считать все картинки из папки, в которой находится скрипт, и вывести их на страницу.


//3. Вывести на экран таблицу умножения от 2 до 10.


//4. В банке открыли депозит под 20% годовых. На депозит положили 300 единиц. Какая сумма единиц будет через 20 лет?
//Какая будет прибыль? Вывести в таблице сумму и прибыль за каждый год.


//5. Вывести число задом наперед (347689 -> 986743)


//6. Разработать скрипт, который будет разбивать число на цифры, считать их количество, находить самую большую,
// самую маленькую цифру в числе, считать сумму цифр, среднее значение.
?>