<?php
//1. Разработать функцию, которая на вход принимает count_elem (количество элементов в массиве), min_val
// (минимальное число, которое может быть записано в элементе массива), max_val (максимальное число, которое 
//может быть записано в элементе массива) и возвращает массив с количеством элементов count_elem. Каждый
// элемент — это число, которое генерируется случайным значением от min_val до max_val (если min_val больше
// max_val, поменять их значения местами).

echo "<br>";
//2. Разработать функцию, которая на вход принимает два числа: число, которое нужно возвести в степень и
// число-степень до которого нужно возвести. Возвращает число, возведенное в степень.

echo "<br>";
//3. Разработать функцию, которая на вход принимает ссылки на два числа и меняет их местами.

echo "<br>";
//4. Разработать функцию, которая на вход принимает пример в виде строки, а на выходе возвращает подсчитанный
// результат. Требования к примеру: однозначные числа, действия +, -, *, /. Операции должны происходить в
// правильной математической последовательности (сначала действия *, /, затем +, -).

echo "<br>";
//5. Добавить к предыдущему заданию возможность посчитать пример со скобками и с многозначными числами.

?>