<?php
//1. Вывести на страницу текстовое поле и кнопку. По клику на кнопке страница обновляется и под текстовым полем
// отображается то, что пользователь ввел в текстовое поле.

echo "<br>";
//2. Вывести на страницу текстовое поле, кнопку и список стран. Пользователь вводит текст в поле, нажимает
// кнопку и в списке выводятся только те страны, которые удовлетворяют условию поиска (строка поиска в
// результатах выделяется жирным и окрашена в красный).

echo "<br>";
//3. Разработать форму логина. В скрипте создать 2 переменные login и password и заполнить их какими-то строками.
// По клику на кнопке Login программа проверяет,совпадает ли то, что ввел пользователь со значениями, которые
// записаны в переменных. Если login и password совпадают, пользователь переходит на главную страницу, где
// находится блок Hello. Если нет, то выдается ошибка, и пользователя просят ввести логин и/или пароль еще раз
// или зарегистрироваться. По клику на кнопке регистрации, пользователь переходит на страницу регистрации и
// видит форму регистрации, которая состоит из login, password, confirm password, email, phone number. 

echo "<br>";
//4. Добавить валидацию к каждому полю регистрации. Если будет ошибка, это поле выделяется красной рамкой
// и выводится ошибка.

echo "<br>";
//5. Разработать форму Contact Us. В форме есть поля name, phone, message, и кнопка send . По клику на кнопке
// контент формы отображается в блоке <div> под формой.

?>