<?php
//1. Создать массив из 10 элементов (чисел). Вывести:
    //a) элементы, которые больше предыдущих;
    //b) среднее значение и сумму всех элементов;
    //c) отсортировать нечетные элементы массива по убыванию.

//2. Создать массив из 5 дат. Скриптом определить сколько дней находится в пределах между двумя соседними датами.

//3. В массиве есть 10 элементов с такими ключами: type, value. Вывести 10 записей с type и value, записанными
// в каждом элементе.

//4. Создать массив фигур (название фигуры, координаты, цвет), на основе массива построить страницу и на ней
// нарисовать фигуры с заданным цветом и в указанном месте.

//5. Создать массивы: процессор, материнская плата, оперативная память, жесткий диск, блок питания. Описание элемента массива:
    //a) Процессор:
        //— название;
        //— сокет;
        //— частота;
        //— количество ядер.
    //b) Материнская плата:
        //— название;
        //— сокет;
        //— тип памяти.
    //c) Оперативная память:
        //— название;
        //— тип памяти;
        //— объем памяти.
    //d)Жесткий диск:
        //— название;
        //— тип диска;
        //— объем.
    //e) Блок питания:
        //— название;
        //— мощность.
//Разработать скрипт, который будет возвращать возможные комбинации ПК.

//6. Есть массив из 3-х элементов (Header, Content, Footer), который состоит из высоты, цвета фона, цвет текста.
// Создайте страницу на основе этого массива.
?>