<?php
//1. Создать массив из 10 элементов, которые генерируются случайным образом от 10 до 100. Перевернуть массив
// задом наперед, используя только одну переменную.

echo "<br>";
//2. Создать массив из 10 элементов и заполнить его случайными числами от 10 до 100. Создать переменную,
// записать в нее число и реализовать алгоритм поиска данного числа в массиве. Если число было найдено, вывести
// порядковый номер элемента, если нет — вывести сообщение (No result for <Number>), где Number — число.

echo "<br>";
//3. Создать массив рекламных баннеров, содержащий Название баннера и URL-изображение (Изображения сохраняются
// в папке img, которая находится в корне сайта). При каждом запуске страницы, случайно выбирать и показывать
// баннер на странице.

echo "<br>";
//4. Создать числовой массив из 5 элементов. Элементом массива является массив из 5 цифр. Заполнить элементы
// случайными числами от 10 до 100. Вывести массив на страницу и отсортировать элементы по возрастанию.

echo "<br>";
//5. Создать 2 массива цифр по 10 элементов каждый. Разработать скрипт, который будет создавать третий 
//массив и записывать в него те элементы, которые присутствуют в одном массиве, но нет в другом.

echo "<br>";
//6. Создать массив из 10 элементов вида X, Y. Дополнительно создать массив цветов. Вывести на страницу 10 div,
// разместить их в координатах X, Y и закрасить случайным цветом из массива цветов.

?>