<?php 
//1. Создать массив из 10 элементов (чисел). Вывести:
    //a) четные элементы;
    //b) максимальный и минимальный элемент;
    //c) отсортировать массив по возрастанию.

echo "<br>";
//2. Создать 2 массива с числами по 10 элементов. Создать скрипт, который объединит уникальные значения из двух
// массивов в один. 

echo "<br>";
//3. Создать массив из 10 элементов. Посчитать количество повторов каждого числа в массиве (цвет цифр, в которых
// нет повторов — красный, цвет тех чисел, в которых есть повторы — синий). Размер текста — 20рх. Число в каждой
// строке выделять жирным.

echo "<br>";
//4. Создать массив фруктов (состоит из названия, типа, цены и количества). Проделать с массивом такие действия:
    //d) вывести только цитрусовые;
    //e) посчитать и вывести цену фруктов;
    //f) посчитать общую цену всех фруктов.

echo "<br>";
//5. Создать массив со странами и вывести <select>-элемент, который будет включать в себя список стран

echo "<br>";
//6. Создать массив, который будет содержать название изображения, ссылки и альтернативный текст на следующие
// ресурсы: Youtube, Facebook, Google, Gmail и разработать <div>, который будет показывать изображение и по
// клику на изображение будет перенаправлять на соответствующий сайт.

?>